tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "caskroom/cask"
tap "bashdot/tap"
brew "git"
brew "htop"
brew "node"
brew "tree"
brew "font-fira-code"
cask "visual-studio-code"
cask "shifty"
brew "rbenv"
brew "gmp"
brew "gnupg"
brew "mas"
brew "node"
brew "sqlite"
brew "bashdot"
brew "nvm"